print("-" * 50)

s = [1, 7, 13, "one", "five", 3.88]
s.append("новый файл")
print(s)

print("-" * 50)

s = [1, 7, 13, "one", "five", 3.88]
s.insert(2, "шляпа")
print(s)

print("-" * 50)

#3 pop забирает элемент из списка себе

s = [1, 7, 13, "one", "five", 3.88]
s.pop()
print(s)

print("-" * 50)

#4 считает определенное колличество элиментов в списке

s = [1, 7, 7, 13, 13, 13, "one", "five", 3.88]
print(s.count(7))

print("-" * 50)

#5 Сортирует список

s = [1, 3, 5, 11, 1075, 2]
print(sorted(s))

print("-" * 50)



